Revit 2027 API
ElementLevelFilter(ElementId, Boolean) Constructor
 Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementLevelFilter(
	ElementId levelId,
	bool inverted
)
Public Sub New (
	levelId As ElementId,
	inverted As Boolean
)
public:
ElementLevelFilter(
	ElementId^ levelId,
	bool inverted
)
new :
        levelId : ElementId *
        inverted : bool -> ElementLevelFilter
Parameters
levelId ElementId
 The id of the level that will be matched to elements' associated level.
inverted Boolean
 True if the filter should match all elements not associated to the given level.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementLevelFilter Class
ElementLevelFilter Overload
Autodesk.Revit.DB Namespace